{
    "profile": {
        "name": "MUHAMMAD AMIN HAIQAL BIN ROSLEE",
        "address": "Klang, Selangor",
        "email": "aminhaiqal15@gmail.com",
        "phone": "(+60) 17-667 2587",
        "linkedin": "https://www.linkedin.com/in/amin-haiqal",
        "github": "https://github.com/aminhaiqal"
    },
    "about_me": "I am a driven full-stack developer with a deep passion for solving complex problems through technology. Holding a degree in Computer Science (Software Engineering) from Universiti Teknologi Malaysia, I specialize in AI/ML applications, cloud computing, and scalable web development. I am particularly focused on integrating generative AI models to create innovative solutions that have a meaningful, real-world impact. With expertise in technologies such as React, Django, TypeScript, and AWS, I take pride in building secure, high-performance, and user-centric applications that are designed to scale and adapt. What excites me most is the constant opportunity to learn, evolve, and push the boundaries of what's possible in tech. My goal is to continually challenge myself and deliver solutions that not only drive the success of businesses but also enrich the lives of users in ways that truly matter.", 
    "education": [
        {
            "inst": "Universiti Teknologi Malaysia (UTM)",
            "study": "Bachelor of Computer Science (Software Engineering) with Honours",
            "year": "2021-2024",
            "cgpa": "3.57"
        },
        {
            "inst": "Universiti Teknologi Malaysia (UTM)",
            "study": "Foundation in Engineering",
            "year": "2019-2020",
            "cgpa": "3.56"
        }
    ],
    "work_experience": [
        {
            "company": "MONITORSCAPE S.R.L.",
            "job": "Co-Founder & Software Engineer",
            "year": "2023-Present",
            "contribution": {
                "c1": "Co-founded MONITORSCAPE, a regulatory monitoring and stakeholder management SaaS platform, designed to empower public affairs professionals with efficient tools for legislative tracking and stakeholder engagement.",
                "c2": "Led the development of key platform features, including automated legislative bill tracking, real-time notifications, and an advanced stakeholder management system.",
                "c3": "Integrated generative AI (via ChatGPT API) to provide real-time summaries and categorize legal documents, significantly enhancing the user experience and reducing data processing time by 75%.",
                "c4": "Engineered full-stack web applications with a focus on scalability, security, and performance using Python, Django, React, PostgreSQL, and AWS.",
                "c5": "Utilized Docker and AWS to ensure high availability and manage containerized deployments, allowing the platform to scale seamlessly during traffic spikes."
            }
        },
        {
            "company": "ARMO - Asociația Română a Magazinelor Online",
            "job": "Software Engineer Intern",
            "year": "2023-2024",
            "contribution": {
                "c1": "Contributed to the development of MONITORSCAPE, a regulatory monitoring and stakeholder management platform, by focusing on data scraping to automate the collection of legislative data from multiple government portals.",
                "c2": "Developed and optimized web scraping solutions that reduced data collection time from hours to minutes, enhancing the platform's ability to provide up-to-date legislative information in real-time.",
                "c3": "Assisted in integrating AI-powered features such as ChatGPT API for categorizing and summarizing legislative initiatives, contributing to the platform's intelligent automation.",
                "c4": "Gained hands-on experience in deploying and scaling web applications using AWS and Docker, ensuring platform stability, performance, and high availability during peak traffic periods."
            }
        }
    ],
    "project_experience": [
        {
            "project": "MONITORSCAPE: A Regulatory Monitoring and Stakeholder Management Platform (SaaS)",
            "tech_stack": "React (Typescript), Python, PostgreSQL, Postman, Docker, AWS, Git, Ansible",
            "year": "2023-Present",
            "contribution": {
                "c1": "Co-founded and developed a comprehensive web platform designed to streamline regulatory monitoring and stakeholder management for public affairs professionals, enhancing operational efficiency and providing a scalable, secure solution.",
                "c2": "Engineered key features including automated legislative bill tracking, real-time notifications, and a robust stakeholder management system to improve user engagement and data accessibility.",
                "c3": "Led full-stack development using Python, Django, React, TypeScript, and AWS, ensuring the application is scalable and high-performing to handle increasing traffic and complexity.",
                "c4": "Integrated AI-powered summaries via the ChatGPT API, automating the categorization and summarization of legislative initiatives, reducing manual work and delivering timely, relevant insights to users.",
                "c5": "Designed a user-friendly interface and developed stakeholder engagement tools, such as email alerts, and interactive dashboards, improving communication and participation.",
                "c6": "Deployed and scaled the platform using AWS, ensuring high availability and optimizing performance during traffic spikes.",
                "c7": "As part of the internship, contributed to the data scraping architecture for automating data extraction from government portals, significantly reducing data collection time from hours to minutes and increasing efficiency in legislative tracking."
            }
        },
        {
            "project": "Quickride: Development of Transportation Services Mobile Application for University Students",
            "tech_stack": "Flutter, Firebase, Stripe",
            "year": "2023-2024",
            "contribution": {
                "c1": "Designed and developed a mobile application tailored to meet the transportation needs of university students, managing all phases from concept to deployment.",
                "c2": "Implemented essential features like ridesharing, real-time location tracking, and secure cashless payments, significantly improving user convenience and accessibility.",
                "c3": "Leveraged Firebase for robust data management and integrated Stripe for secure payment processing, showcasing expertise in modern mobile app development and cloud technologies.",
                "c4": "Optimized user experience by focusing on seamless navigation and intuitive interface design, resulting in a smooth and efficient ride-booking process for students."
            }
        }
    ],
    "related_skills": [
        {
            "technical_skills": {
                "Web Development & Frameworks": [
                    "Django", "React.js", "Redux", "Spring Boot", "Node.js", "Flutter", "Ant Design", "Tailwind CSS"
                ],
                "Databases & Data Management": [
                    "PostgreSQL", "MySQL", "Redis", "Firebase", "Prisma", "RDS", "S3"
                ],
                "DevOps & Cloud": [
                    "AWS (EC2, S3, Lambda, RDS)", "GCP", "Docker", "Ansible", "Nginx"
                ],
                "Version Control & CI/CD": [
                    "Git", "GitHub", "Postman"
                ],
                "UI/UX & Design": [
                    "Figma", "Shadcdn", "Ant"
                ],
                "Miscellaneous": [
                    "RESTful APIs", "Stripe", "Linux"
                ]
            },
            "soft_skills": [
                "Leadership and team collaboration",
                "Problem-solving and critical thinking",
                "Project management and organization",
                "Adaptability and quick learning"
            ],
            "language_proficiency": {
                "Malay": {
                    "Reading": "Native",
                    "Writing": "Native",
                    "Communication": "Native"
                },
                "English": {
                    "Reading": "Fluent",
                    "Writing": "Fluent",
                    "Communication": "Proficient"
                }
            }
        }        
    ]
}